       IDENTIFICATION DIVISION.
       PROGRAM-ID. SALESRECORD.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT SALES-IN ASSIGN TO "SALESR~1.TXT".
           SELECT SALES-OUT ASSIGN TO "SALESC~1.TXT".
       DATA DIVISION.
       FILE SECTION.
       FD  SALES-IN
	       LABEL RECORD IS STANDARD
           RECORD CONTAINS 47 CHARACTERS
           DATA RECORD IS SALESMANS.
       01  SALESMANS.
           05 SALESMAN-NUM PIC X(10).
           05 SALESMAN-NAME PIC X(30).
           05 TOT-SALES PIC 9(5)V99.
       FD  SALES-OUT.
       01  SALES-LIST.
           05 FILLER PIC X(80).
       WORKING-STORAGE SECTION.
       01  SALESMAN-OUT.
           05 SALESMANNO PIC X(10).
           05 FILLER PIC X(10).
           05 SALESMANNA PIC X(30).
           05 TOTSALES PIC Z99,999.00.
           05 FILLER PIC X(5).
           05 TOTCOMM PIC ZZ9,999.99.
       01  OTHER-FIELDS.
           05 PROCSLSMN PIC X(30).
           05 TOTAL-SALES PIC 9(6)V99 VALUE 0.
           05 TOTAL-COMM PIC 9(6)V99 VALUE 0.
           05 TOTAL-ACC-SALES PIC 9(7)V99 VALUE 0.
           05 TOTAL-ACC-COMM PIC 9(7)V99 VALUE 0.
           05 TOTAL-ACC-SALESMAN PIC 9(3) VALUE 0.
           05 EOF PIC A VALUE 'N'.
       01  HDR1.
           05 FILLER PIC X(26).
           05 FILLER PIC X(28) VALUE 'LUCKY CHARM ENTERPRISE, INC'.
           05 FILLER PIC X(26).
       01  HDR2.
           05 FILLER PIC X(32).
           05 FILLER PIC X(16) VALUE 'BINONDO, MANILA'.
           05 FILLER PIC X(32).
       01  HDR3.
           05 FILLER PIC X(33).
           05 FILLER PIC X(13) VALUE 'SALES REPORT'.
           05 FILLER PIC X(34).
       01  HDR4.
           05 FILLER PIC X(15) VALUE 'SALESMAN NUMBER'.
           05 FILLER PIC X(5).
           05 FILLER PIC X(13) VALUE 'SALESMAN NAME'.
           05 FILLER PIC X(17).
           05 FILLER PIC X(11) VALUE 'TOTAL SALES'.
           05 FILLER PIC X(5).
           05 FILLER PIC X(10) VALUE 'COMMISSION'.
       01  TOTALACCSALES.
           05 FILLER PIC X(26) VALUE 'TOTAL ACCUMULATED SALES: '.
           05 TOTACCSALES PIC Z,Z99,999.99.
       01  TOTALACCCOMM.
           05 FILLER PIC X(32) VALUE 'TOTAL ACCUMULATED COMMISSION: '.
           05 TOTACCSCOMM PIC Z,Z99,999.99.
       01  TOTALACCSLSMN.
           05 FILLER PIC X(27) VALUE 'TOTAL NUMBER OF SALESMAN: '.
           05 TOTACCSLSMN PIC ZZ9.
       01  BLNK-HDR.
           05 FILLER PIC X(80).
       SCREEN SECTION.
       01  SCRN.
           05 BLANK SCREEN.
       PROCEDURE DIVISION.
       MAIN-RTN.
		   OPEN INPUT SALES-IN.
           OPEN OUTPUT SALES-OUT.
           DISPLAY SCRN.
           WRITE SALES-LIST FROM HDR1.
           WRITE SALES-LIST FROM HDR2.
           WRITE SALES-LIST FROM HDR3 AFTER 2.
           WRITE SALES-LIST FROM HDR4 AFTER 2.
           READ SALES-IN AT END MOVE 'Y' TO EOF.
           MOVE SALESMAN-NUM TO PROCSLSMN.
           MOVE SALESMAN-NUM TO SALESMANNO.
           MOVE SALESMAN-NAME TO SALESMANNA.
           PERFORM TRANS-RTN UNTIL EOF IS EQUAL TO 'Y'.
		   PERFORM SALES-COMM-RTN.
           PERFORM FINAL-RTN.
           DISPLAY 'SALESMAN PROGRAM ENDS!'.
           CLOSE SALES-IN, SALES-OUT.
           STOP RUN.
       TRANS-RTN.
           IF SALESMAN-NUM IS EQUAL TO PROCSLSMN
              PERFORM SALES-LIST-RTN
           ELSE
              PERFORM SALES-COMM-RTN
              PERFORM STUD-BRK-RTN.
           READ SALES-IN AT END MOVE 'Y' TO EOF.

       SALES-LIST-RTN.
           ADD TOT-SALES TO TOTAL-SALES.

       SALES-COMM-RTN.
           IF TOTAL-SALES < 5000
              COMPUTE TOTAL-COMM = TOTAL-SALES * 0.1
           ELSE IF TOTAL-SALES < 10000
              COMPUTE TOTAL-COMM = TOTAL-SALES * 0.15
           ELSE IF TOTAL-SALES < 15000
              COMPUTE TOTAL-COMM = TOTAL-SALES * 0.20
           ELSE IF TOTAL-SALES < 20000
              COMPUTE TOTAL-COMM = TOTAL-SALES * 0.25
           ELSE IF TOTAL-SALES < 25000
              COMPUTE TOTAL-COMM = TOTAL-SALES * 0.30
           ELSE IF TOTAL-SALES < 30000
              COMPUTE TOTAL-COMM = TOTAL-SALES * 0.35
           ELSE IF TOTAL-SALES < 35000
              COMPUTE TOTAL-COMM = TOTAL-SALES * 0.40
           ELSE IF TOTAL-COMM >= 35000
              COMPUTE TOTAL-COMM = TOTAL-SALES * 0.50
           END-IF.
           MOVE TOTAL-SALES TO TOTSALES.
           MOVE TOTAL-COMM TO TOTCOMM.
           ADD TOTAL-SALES TO TOTAL-ACC-SALES.
           ADD TOTAL-COMM TO TOTAL-ACC-COMM.
		   ADD 1 TO TOTAL-ACC-SALESMAN.
           WRITE SALES-LIST FROM SALESMAN-OUT.

       STUD-BRK-RTN.
           MOVE SALESMAN-NUM TO PROCSLSMN.
           MOVE SALESMAN-NUM TO SALESMANNO.
           MOVE SALESMAN-NAME TO SALESMANNA.
           MOVE 0 TO TOTAL-SALES.
		   MOVE 0 TO TOTAL-COMM.
           PERFORM SALES-LIST-RTN.

       FINAL-RTN.
           MOVE TOTAL-ACC-SALES TO TOTACCSALES.
           MOVE TOTAL-ACC-COMM TO TOTACCSCOMM.
           MOVE TOTAL-ACC-SALESMAN TO TOTACCSLSMN.
           WRITE SALES-LIST FROM TOTALACCSALES.
           WRITE SALES-LIST FROM TOTALACCCOMM.
           WRITE SALES-LIST FROM TOTALACCSLSMN.
